<h1><center>Experiment 1</center></h1>
<h2><center> Introduction to SQLite using Python<h2><center>

In [29]:
import sqlite3

In [30]:
import pandas as pd

In [31]:
#created a column (col) with values 1,2,3,4,5
df = pd.DataFrame({"COL":[1,2,3,4,5]})

In [32]:
# displaying col
df

   COL
0    1
1    2
2    3
3    4
4    5

In [33]:
# creating and connecting to that database
conn = sqlite3.connect("example_1.db")

In [34]:
# checking the database connection
conn

In [36]:
# creating table1 table in example_1 database
df.to_sql('Table1',conn)

In [37]:
# creating a sql query
sql = " select * from Table1  "

In [38]:
pd.read_sql(sql,conn)

   index  COL
0      0    1
1      1    2
2      2    3
3      3    4
4      4    5

<h1><center>Experiment 2</center>
<h2><center>Basic SQL Commands using SQLITE3</center><h2>
<ul>
    <li><h6>Create Table</h6></li>
    <li><h6>Insert values into table </h6></li>
    <li><h6>Select from table</h6></li>
    <li><h6>Update from table</h6></li>
    <li><h6>Delete from table</h6></li>
</ul>

In [1]:
import sqlite3

In [2]:
# creating and connecting to that database
conn=sqlite3.connect('exp2.db')

### Creating Table Student

In [3]:
conn.execute('''CREATE TABLE IF NOT EXISTS Student( 
                         s_id INTEGER PRIMARY KEY, 
                         name  VARCHAR(50) not null,
                         age INTEGER,
                         course VARCHAR(20)
                         )''')

### Inserting values into student table

In [13]:
conn.execute("insert into student values(10001,'Sagar Verma',20,'B.Tech(CSE)');")
conn.execute("insert into student values(10002,'Varun Sharma',21,'B.Tech(ME)');")
conn.execute("insert into student values(10003,'Ram Mehra',19,'B.Tech(CE)');")
conn.execute("insert into student values(10004,'Ajay Malhotra',18,'B.Tech(CSE)');")

### Select query from student

In [15]:
for row in conn.execute('Select * from student'):
    print(row)

(10001, 'Sagar Verma', 20, 'B.Tech(CSE)')
(10002, 'Varun Sharma', 21, 'B.Tech(ME)')
(10003, 'Ram Mehra', 19, 'B.Tech(CE)')
(10004, 'Ajay Malhotra', 18, 'B.Tech(CSE)')

### Update

In [16]:
conn.execute("UPDATE Student SET age = 24 WHERE name = 'Ram Mehra';")

In [17]:
for row in conn.execute('Select * from student'):
    print(row)

(10001, 'Sagar Verma', 20, 'B.Tech(CSE)')
(10002, 'Varun Sharma', 21, 'B.Tech(ME)')
(10003, 'Ram Mehra', 24, 'B.Tech(CE)')
(10004, 'Ajay Malhotra', 18, 'B.Tech(CSE)')

### Delete

In [18]:
conn.execute("DELETE FROM Student WHERE s_id = 10004;")

In [19]:
for row in conn.execute('Select * from student'):
    print(row)

(10001, 'Sagar Verma', 20, 'B.Tech(CSE)')
(10002, 'Varun Sharma', 21, 'B.Tech(ME)')
(10003, 'Ram Mehra', 24, 'B.Tech(CE)')